const mockData = {
  name: '贵州茅台酒股份有限公司',
  children: [
    {
      children: [
        {
          name: '中国工商银行',
          value: '0.28%',
          children: [
            {
              name: '上海证券交易所',
              children: [
                {
                  name: '上海证券交易所'
                },
                {
                  name: '深圳证券交易所'
                },
                {
                  name: '上海证券交易所'
                },
                {
                  name: '上海证券交易所'
                },
                {
                  name: '上海证券交易所'
                },
                {
                  name: '上海证券交易所'
                },
                {
                  name: '上海证券交易所'
                },
                {
                  name: '上海证券交易所'
                },
                {
                  name: '上海证券交易所'
                },
                {
                  name: '上海证券交易所'
                },
                {
                  name: '上海证券交易所'
                },
                {
                  name: '上海证券交易所'
                },
                {
                  name: '上海证券交易所'
                }
              ]
            },
          ]
        },
        {
          name: '中国证券金融股份有限公司',
          value: '0.67%',
          children: [
            {
              name: '上海证券交易所',
              children: [
                {
                  name: '上海证券交易所'
                },
                {
                  name: '深圳证券交易所'
                },
                {
                  name: '上海证券交易所'
                },
              ]
            },
            {
              name: '深圳证券交易所'
            },
            {
              name: '上海证券交易所'
            },
          ]
        },
        {
          name: '中国工商银行',
          value: '0.28%',
          children: [
            {
              name: '上海证券交易所'
            },
            {
              name: '深圳证券交易所'
            },
            {
              name: '上海证券交易所'
            },
          ]
        },
        {
          name: '中国证券金融股份有限公司',
          value: '0.67%',
          children: [
            {
              name: '中国证券金融股份有限公司',
              value: '0.67%',
              children: [
                {
                  name: '中国证券金融股份有限公司',
                  value: '0.67%'
                },
                {
                  name: '中国工商银行',
                  value: '0.28%'
                },
                {
                  name: '中国工商银行',
                  value: '0.28%'
                },
                {
                  name: '中国工商银行',
                  value: '0.28%'
                },
                {
                  name: '中国工商银行',
                  value: '0.28%'
                },
                {
                  name: '中国证券金融股份有限公司',
                  value: '0.67%',
                  children: [
                    {
                      name: '中国证券金融股份有限公司',
                      value: '0.67%'
                    }
                  ]
                },
              ]
            },
            {
              name: '中国证券金融股份有限公司',
              value: '0.67%'
            }
          ]
        },
        {
          name: '中国工商银行',
          value: '0.28%'
        },
        {
          name: '中国证券金融股份有限公司',
          value: '0.67%'
        },
        {
          name: '中国工商银行',
          value: '0.28%'
        },
        {
          name: '中国证券金融股份有限公司',
          value: '0.67%',
          children: [
            {
              name: '中国证券金融股份有限公司',
              value: '0.67%',
              children: [
                {
                  name: '中国证券金融股份有限公司',
                  value: '0.67%'
                },
                {
                  name: '中国证券金融股份有限公司',
                  value: '0.67%'
                },
                {
                  name: '中国证券金融股份有限公司',
                  value: '0.67%'
                },
                {
                  name: '中国证券金融股份有限公司',
                  value: '0.67%'
                },
                {
                  name: '中国证券金融股份有限公司',
                  value: '0.67%'
                }
              ]
            }
          ]
        },
        {
          name: '中国工商银行',
          value: '0.28%'
        },
        {
          name: '中国证券金融股份有限公司',
          value: '0.67%'
        },
        {
          name: '中国工商银行1111',
          value: '0.28%',
          children: [
            {
              name: '中国证券金融股份有限公司',
              value: '0.67%'
            },
            {
              name: '中国证券金融股份有限公司',
              value: '0.67%'
            },
            {
              name: '中国证券金融股份有限公司',
              value: '0.67%'
            },
            {
              name: '中国证券金融股份有限公司',
              value: '0.67%'
            }
          ]
        },
        {
          name: '中国证券金融股份有限公司',
          value: '0.67%'
        },
        {
          name: '中国工商银行',
          value: '0.28%'
        },
        {
          name: '中国证券金融股份有限公司',
          value: '0.67%'
        }
      ]
    }, {
      children: [
        {
          name: '北京双国九茗投资有限公司',
          children: [
            {
              name: '贵州赖茅就业有限公司'
            },
            {
              name: '贵州赖茅就业有限公司'
            },
            {
              name: '贵州赖茅就业有限公司'
            },
            {
              name: '贵州赖茅就业有限公司'
            }
          ]
        },
        {
          name: '北京友谊使者商业有限公司',
          children: [
            {
              name: '贵州赖茅就业有限公司'
            },
            {
              name: '贵州赖茅就业有限公司'
            },
            {
              name: '贵州赖茅就业有限公司'
            },
            {
              name: '贵州赖茅就业有限公司'
            }
          ]
        },
        {
          name: '贵州茅台酒厂'
        },
        {
          name: '贵州赖茅就业有限公司'
        },
        {
          name: '北京双国九茗投资有限公司'
        },
        {
          name: '北京友谊使者商业有限公司'
        },
        {
          name: '贵州茅台酒厂'
        },
        {
          name: '贵州赖茅就业有限公司'
        },
        {
          name: '贵州赖茅就业有限公司'
        },
        {
          name: '贵州赖茅就业有限公司'
        },
        {
          name: '贵州赖茅就业有限公司'
        },
        {
          name: '贵州赖茅就业有限公司'
        }
      ]
    }
  ]
}

export default mockData
